Console.Clear();
//  Задача на квадрат числа
int number = Convert.ToInt32(Console.ReadLine()); 

Console.WriteLine("Квадрат = " + number*number);
