Console.Clear();
//  Задача на квадрат числа
Console.WriteLine("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine()); 

Console.WriteLine("Квадрат числа " + number +" = "+ number*number);

// int result = Convert.ToInt32(Math.Pow(number, 2));
// Console.WriteLine("Квадрат числа = " + result);

